{
    "broadArea": {
        "name": "Computer Science and Engineering",
        "link": "http://vlab.co.in/broad-area-computer-science-and-engineering",
        "code": "CSE"
    },
    "lab": "Automata and Formal Languages - II",
    "lab_display_name": "Automata and Formal Languages - II",
    "phase": "3-ext",
    "collegeName": "IIITH",
    "baseUrl": "afl2-iiith.vlabs.ac.in",
    "introduction": "Automata and Formal Languages - II advances from regular and context-free languages to the full computational power of Turing machines, completing the hierarchy of formal languages and automata. Students examine deep structural properties of context-free languages through ambiguity analysis, parsing algorithms, and equivalence proofs between computational models. The introduction of Turing machines marks a pivotal transition to universal computation, where students explore both deterministic and nondeterministic models that define the limits of algorithmic solvability. Through pumping lemmas and equivalence demonstrations, learners develop proof techniques essential for establishing language properties and computational boundaries. This part synthesizes theoretical computer science foundations, connecting automata theory to computability, complexity theory, and the philosophical question of what can be computed.",
    "experiments": [
  {
    "name": "Equivalence of PDA and CFG",
    "short-name": "pda-cfg-equivalence",
    "repo": "https://github.com/virtual-labs/exp-equivalence-pa-cfg-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Demonstration of Ambiguity with Context-Free Grammars",
    "short-name": "cfg-ambiguity",
    "repo": "https://github.com/virtual-labs/exp-demonstration-of-ambiguity-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "CYK Algorithm",
    "short-name": "cyk-algorithm",
    "repo": "https://github.com/virtual-labs/exp-cyk-algorithm-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Acceptance by Deterministic Turing Machine",
    "short-name": "dtm-acceptance",
    "repo": "https://github.com/virtual-labs/exp-deterministic-turing-machine-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Acceptance by Non-deterministic Turing Machine",
    "short-name": "ndtm-acceptance",
    "repo": "https://github.com/virtual-labs/exp-non-deterministic-turing-machine-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Equivalence of 2-Stack PDA and DTM",
    "short-name": "2stack-pda-dtm-equivalence",
    "repo": "https://github.com/virtual-labs/exp-equivalence-pda-dtm-iiith",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Pumping Lemma for CFGs and RL",
    "short-name": "pumping-lemma-cfg-rl",
    "repo": "https://github.com/virtual-labs/exp-pumping-lemma-cf-rl-iiith",
    "tag": "v1.0.0",
    "deploy": true
  }
],
    "targetAudience": {
        "UG": [
            "3rd Year (5th semester)"
        ],
        "PG": []
    },
    "objective": "<ul><li>Analyze Language Structure: Investigate the equivalence between pushdown automata and context-free grammars, understanding multiple perspectives on context-free language recognition and their applications in parser design.</li><li>Address Parsing Challenges: Explore ambiguity in context-free grammars and apply the CYK algorithm to determine membership in context-free languages, developing skills critical for syntax analysis and compiler optimization.</li><li>Master Universal Computation: Study deterministic and nondeterministic Turing machines to understand the theoretical limits of computation, establishing foundations for computability theory and algorithmic problem-solving.</li><li>Prove Computational Equivalences: Demonstrate that different computational models have equivalent power through constructions like 2-stack PDA to DTM conversion, deepening understanding of what makes models computationally universal.</li><li>Establish Language Boundaries: Apply pumping lemmas for regular and context-free languages to prove non-membership results, developing rigorous proof techniques essential for theoretical computer science and understanding computational limitations.</li><li>Extend Computational Power: Investigate pushdown automata and context-free grammars to recognize nested and hierarchical structures, essential for parsing programming languages and natural language processing.</li><li>Bridge Syntax and Semantics: Connect formal language definitions with machine-based recognition, preparing for compiler construction and formal verification of software systems.</li></ul>",
    "courseAlignment": {
        "description": "Formal Language & Automata Theory is a professional core course in.",
        "universities": [
            "Computer Science and Engineering (PCC-CS502) recommended in the AICTE model curriculum."
        ]
    }
}
